krist10an/xplain-software-framework/source/drivers/usb/at90usb/at90usb_udc.c
/**
 * \file
 *
 * \brief AT90USB driver: Device part
 *
 * This file implements a USB Device Controller (UDC) driver utilizing
 * the AT90USB controller hardware.
 *
 * Copyright (C) 2009 Atmel Corporation. All rights reserved.
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 * this list of conditions and the following disclaimer in the documentation
 * and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 * from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 * Atmel AVR product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH
 * DAMAGE.
 */
#include <assert.h>
#include <byteorder.h>
#include <bitops.h>
#include <debug.h>
#include <interrupt.h>
#include <io.h>
#include <status_codes.h>
#include <string.h>
#include <util.h>
#include <workqueue.h>

#include <usb/request.h>
#include <usb/dev.h>
#include <usb/udc.h>
#include <usb/udc_lib.h>

#include <chip/regs.h>
#include <chip/memory-map.h>
#include <chip/at90usb.h>

#include <app/usb.h>

#include "at90usb_internal.h"
#include "at90usb_regs.h"

/* Configuration sanity-checks */
#if !defined(CONFIG_UDC_LOW_SPEED) && !defined(CONFIG_UDC_FULL_SPEED)
# error No valid USB speed has been configured
#endif
#if defined(CONFIG_UDC_HIGH_SPEED)
# error High-speed configuration not supported on this chip
#endif
#if defined(CONFIG_UDC_FULL_SPEED) && !defined(CHIP_AT90USB_UDC_FULL_SPEED)
# error Full-speed configuration not supported on this chip
#endif
#if defined(CONFIG_UDC_LOW_SPEED)
# if !defined(CHIP_AT90USB_UDC_LOW_SPEED)
#  error Low-speed configuration not supported on this chip
# endif
# if defined(CONFIG_UDC_FULL_SPEED)
#  error Low-speed configuration must be selected exclusively
# endif
#endif

/**
 * \internal
 * \brief Helper function to read data from the USB fifo.
 *
 * \param dest The destination to copy to.
 * \param len Number of bytes to read from the FIFO.
 */
static void copy_from_fifo(uint8_t *dest, const unsigned int len)
{
	unsigned int i;

	for (i = 0; i < len; i++)
		dest[i] = avr_read_reg8(UEDATX);
}

/**
 * \internal
 * \brief Helper function to write data to the USB fifo.
 *
 * \param source The destination to copy from.
 * \param len Number of bytes to write to the FIFO.
 */
static void copy_to_fifo(const uint8_t *source, const unsigned int len)
{
	unsigned int i;

	for (i = 0; i < len; i++)
		avr_write_reg8(UEDATX, source[i]);
}

/**
 * \addtogroup udc_group
 * @{
 */

/**
 * \internal
 * \brief Helper function get the AT90USB UDC instance from the UDC instance.
 *
 * \param udc An UDC instance.
 *
 * \return The AT90USB UDC instance.
 */
static inline struct at90usb_udc *at90usb_udc_of(struct udc *udc)
{
	return container_of(udc, struct at90usb_udc, udc);
}

/**
 * \internal
 * \brief Helper function get the AT90USB UDC instance from the work
 *        queue task.
 *
 * \param task A work queue task.
 *
 * \return The AT90USB UDC instance.
 */
static inline
struct at90usb_udc *at90usb_udc_task_of(struct workqueue_task *task)
{
        return container_of(task, struct at90usb_udc, task);
}

/**
 * \internal
 * \brief Helper function get the AT90USB UDC endpoint instance from the work
 *        queue task.
 *
 * \param task A work queue task.
 *
 * \return The AT90USB UDC endpoint instance.
 */
static inline
struct at90usb_udc_ep *at90usb_ep_task_of(struct workqueue_task *task)
{
	return container_of(task, struct at90usb_udc_ep, task);
}

/**
 * \internal
 * \brief Helper function to complete USB requests.
 *
 * This helper function will set the USB request status flag and call the
 * request done callback if needed.
 *
 * \param udc The UDC instance.
 * \param req A completed USB request.
 * \param status Status code for the completed USB request.
 */
static void at90usb_udc_req_done(struct udc *udc, struct usb_request *req,
		enum status_code status)
{
	req->status = status;

	if (req->req_done)
		req->req_done(udc, req);
}

/**
 * \internal
 * \brief Kill last bank for an IN endpoint.
 *
 * \pre In interrupt handler and/or interrupts disabled and with the
 *      appropriate endpoint selected through the \ref AVR_REG_UENUM UENUM
 *      register.
 */
static void at90usb_udc_kill_last_in_bank(void)
{
	avr_write_reg8(UEINTX, avr_read_reg8(UEINTX) | AT90USB_UEINTX_KILLBK);
	while (avr_read_reg8(UEINTX) & AT90USB_UEINTX_KILLBK)
		barrier();
}

/**
 * \internal
 * \brief Kill first bank for an OUT endpoint.
 *
 * \pre In interrupt handler and/or interrupts disabled and with the
 *      appropriate endpoint selected through the \ref AVR_REG_UENUM UENUM
 *      register.
 */
static void at90usb_udc_kill_first_out_bank(void)
{
	avr_write_reg8(UEINTX, avr_read_reg8(UEINTX)
			& ~(AT90USB_UEINTX_RXOUTI | AT90USB_UEINTX_FIFOCON));
}

/**
 * \internal
 * \brief Kill all banks for an endpoint.
 *
 * \pre In interrupt handler and/or interrupts disabled and with the
 *      appropriate endpoint selected through the \ref AVR_REG_UENUM UENUM
 *      register.
 *
 * \param udc The UDC instance.
 * \param ep_id Endpoint number.
 */
static void at90usb_udc_kill_all_banks(struct udc *udc, usb_ep_id_t ep_id)
{
	bool is_in = avr_read_reg8(UECFG0X) & AT90USB_UECFG0X_EPDIR_IN;

