krist10an/xplain-software-framework/source/drivers/usb/at90usb/at90usb_udc.c
	while (AT90USB_UESTA0X_GET_NBUSYBK(avr_read_reg8(UESTA0X))) {
		if (is_in)
			at90usb_udc_kill_last_in_bank();
		else
			at90usb_udc_kill_first_out_bank();
	}
}

void udc_ep0_submit_out_req(struct udc *udc, struct usb_request *req)
{
	struct at90usb_udc	*udc90 = at90usb_udc_of(udc);
	struct at90usb_udc_ep	*ep = &udc90->ep[0];
	irqflags_t		iflags;

	assert(!test_bit(AT90USB_EP_ACTIVE_XFER, &ep->flags));
	assert(slist_is_empty(&ep->buf_queue));
	assert(slist_is_empty(&ep->req_queue));
	assert(ep->buf_offset == 0);

	udc90->ctrl_state = EP0_STATE_DATA_OUT;
	set_bit(AT90USB_EP_ACTIVE_XFER, &ep->flags);
	slist_borrow_to_tail(&ep->buf_queue, &req->buf_list);
	slist_insert_tail(&ep->req_queue, &req->node);
	barrier();

	iflags = cpu_irq_save();

	avr_write_reg8(UENUM, 0);
	ep->ueienx |= AT90USB_UEIENX_RXOUTE;
	avr_write_reg8(UEIENX, ep->ueienx);

	cpu_irq_restore(iflags);
}

void udc_ep0_submit_in_req(struct udc *udc, struct usb_request *req)
{
	struct at90usb_udc	*udc90 = at90usb_udc_of(udc);
	struct at90usb_udc_ep	*ep = &udc90->ep[0];
	irqflags_t		iflags;

	assert(!test_bit(AT90USB_EP_ACTIVE_XFER, &ep->flags));
	assert(slist_is_empty(&ep->buf_queue));
	assert(slist_is_empty(&ep->req_queue));
	assert(ep->buf_offset == 0);

	udc90->ctrl_state = EP0_STATE_DATA_IN;
	set_bit(AT90USB_EP_ACTIVE_XFER, &ep->flags);
	slist_borrow_to_tail(&ep->buf_queue, &req->buf_list);
	slist_insert_tail(&ep->req_queue, &req->node);
	barrier();

	iflags = cpu_irq_save();

	avr_write_reg8(UENUM, 0);
	ep->ueienx |= AT90USB_UEIENX_TXINE;
	avr_write_reg8(UEIENX, ep->ueienx);

	cpu_irq_restore(iflags);
}

status_t udc_ep0_write_sync(struct udc *udc, const void *data, size_t len)
{
	irqflags_t		iflags;
	const uint8_t		*data_p = data;

	assert(len > 0);
	assert(!test_bit(AT90USB_EP_ACTIVE_XFER,
				&at90usb_udc_of(udc)->ep[0].flags));
	avr_write_reg8(UENUM, 0);
	assert(avr_read_reg8(UEINTX) & AT90USB_UEINTX_TXINI);

	len = min_u(len, APP_UDC_MAXPACKETSIZE0);

	copy_to_fifo(data_p, len);

	iflags = cpu_irq_save();
	avr_write_reg8(UEINTX, avr_read_reg8(UEINTX) & ~AT90USB_UEINTX_TXINI);
	cpu_irq_restore(iflags);

	while (!(avr_read_reg8(UEINTX) & AT90USB_UEINTX_TXINI))
		barrier();

	return len;
}

void udc_ep0_send_status(struct udc *udc)
{
	struct at90usb_udc	*udc90 = at90usb_udc_of(udc);
	struct at90usb_udc_ep	*ep = &udc90->ep[0];
	irqflags_t		iflags;

	dbg_verbose("at90usb-udc: send status\n");

	assert(!test_bit(AT90USB_EP_ACTIVE_XFER, &udc90->ep[0].flags));
	avr_write_reg8(UENUM, 0);
	assert(avr_read_reg8(UEINTX) & AT90USB_UEINTX_TXINI);

	iflags = cpu_irq_save();

	ep->ueienx &= ~AT90USB_UEIENX_RXOUTE;
	ep->ueienx |= AT90USB_UEIENX_TXINE;
	avr_write_reg8(UEINTX, avr_read_reg8(UEINTX) & ~AT90USB_UEINTX_TXINI);
	avr_write_reg8(UEIENX, ep->ueienx);

	cpu_irq_restore(iflags);

	udc90->ctrl_state = EP0_STATE_STATUS_IN;
}

void udc_ep0_expect_status(struct udc *udc)
{
	struct at90usb_udc *udc90 = at90usb_udc_of(udc);

	// Here, the TXINI flag must be set for endpoint 0

	assert(!test_bit(AT90USB_EP_ACTIVE_XFER, &udc90->ep[0].flags));

	/*
	 * Don't bother waiting for STATUS OUT. The RX interrupt will
	 * get cleared when we receive the next SETUP packet.
	 */
	udc90->ctrl_state = EP0_STATE_STATUS_OUT;
}

/**
 * \internal
 * \brief Submit queued buffers on a non-control OUT endpoint.
 *
 * \note This function will disable and enable interrupts while processing the
 * queue, but will return with interrupt flag as when called. It will process
 * an entire USB request before calling the callback (if any) and exit,
 * potentially doing a reentry shortly after to process any additional USB
 * requests.
 *
 * \param task Work queue task.
 *
 * \pre ep->active == NULL
 * \pre Called from workqueue, interrupts enabled.
 */
static void at90usb_udc_submit_out_queue(struct workqueue_task *task)
{
	struct at90usb_udc_ep	*ep = at90usb_ep_task_of(task);
	struct at90usb_udc	*udc90 = ep->udc90;
	struct buffer		*buf;
	struct usb_request	*req;
	uint16_t		buf_offset = 0;
	uint16_t		fifo_size;

	if (slist_is_empty(&ep->req_queue))
		goto no_transfer;

	avr_write_reg8(UENUM, ep->id);

	cpu_irq_disable();

	dbg_verbose("ep%u-out: submit req_queue %p status=%02x\n",
			ep->id, slist_peek_head_node(&ep->req_queue),
			avr_read_reg8(UEINTX));

	assert(!test_bit(AT90USB_EP_ACTIVE_XFER, &ep->flags));

	set_bit(AT90USB_EP_ACTIVE_XFER, &ep->flags);

	cpu_irq_enable();

	if (!test_bit(AT90USB_EP_ENABLED, &ep->flags))
		goto no_transfer;

	cpu_irq_disable();
	req = slist_pop_head(&ep->req_queue, struct usb_request, node);
	cpu_irq_enable();
	if (slist_is_empty(&req->buf_list)) {
		assert(slist_is_empty(&ep->req_queue));
		goto no_transfer;
	}

	buf = slist_peek_head(&req->buf_list, struct buffer, node);
	while (slist_node_is_valid(&req->buf_list, &buf->node)) {
		uint16_t nbytes;

		cpu_irq_disable();
		/* Clear RXOUTI control bit to ack the ready bank. */
		avr_write_reg8(UEINTX, avr_read_reg8(UEINTX)
				& ~AT90USB_UEINTX_RXOUTI);
		cpu_irq_enable();

		fifo_size = (avr_read_reg8(UEBCHX) << 8) | avr_read_reg8(UEBCLX);
		nbytes = min_u(fifo_size, buf->len - buf_offset);

		copy_from_fifo((uint8_t *)((uintptr_t)buf->addr.phys
					+ buf_offset), nbytes);

		buf_offset += nbytes;

		cpu_irq_disable();
		/* Clear FIFO bit to ack that the contents are read. */
		avr_write_reg8(UEINTX, avr_read_reg8(UEINTX)
				& ~AT90USB_UEINTX_FIFOCON);
		cpu_irq_enable();

		/*
		 * We got a shorter package than expected. Store number of
		 * transferred bytes and break the while loop to call the
		 * at90usb_udc_req_done.
		 */
		if (fifo_size < ep->maxpacket) {
			req->bytes_xfered += buf_offset;
			break;
		}

		if (buf_offset == buf->len) {
			req->bytes_xfered += buf_offset;

			/*
			 * If this is the last buffer in the request we need an
			 * interrupt to advance to any potential next requests.
			 */
			if (req->buf_list.last == &buf->node)
				break;

			buf = slist_peek_next(&buf->node, struct buffer, node);
			buf_offset = 0;
		}

		/* Wait for a bank to be ready before reading the FIFO. */
		while (!(avr_read_reg8(UEINTX) & AT90USB_UEINTX_RXOUTI)) {
			if (!test_bit(AT90USB_EP_ENABLED, &ep->flags))
				goto no_transfer;
		}
	}

	/* The compiler must not move any stores beyond this point. */
	barrier();

