krist10an/xplain-software-framework/source/drivers/usb/at90usb/at90usb_udc.c
	at90usb_udc_req_done(&udc90->udc, req, 0);

	cpu_irq_disable();
	/* The at90usb_udc_req_done call might change the endpoint. */
	avr_write_reg8(UENUM, ep->id);
	ep->ueienx |= AT90USB_UEIENX_RXOUTE;
	avr_write_reg8(UEIENX, ep->ueienx);
	cpu_irq_enable();

	goto out;

no_transfer:
	cpu_irq_disable();
	ep->ueienx &= ~AT90USB_UEIENX_RXOUTE;
	avr_write_reg8(UEIENX, ep->ueienx);
	cpu_irq_enable();
out:
	clear_bit(AT90USB_EP_ACTIVE_XFER, &ep->flags);
}

/**
 * \internal
 * \brief Submit queued buffers on a non-control IN endpoint.
 *
 * \note This function will disable and enable interrupts while processing the
 * queue, but will return with interrupt flag as when called. It will process
 * an entire USB request before calling the callback (if any) and exit,
 * potentially doing a reentry shortly after to process any additional USB
 * requests.
 *
 * \param task Work queue task.
 *
 * \pre ep->active == NULL
 * \pre Called from workqueue, interrupts enabled.
 */
static void at90usb_udc_submit_in_queue(struct workqueue_task *task)
{
	struct at90usb_udc_ep	*ep = at90usb_ep_task_of(task);
	struct at90usb_udc	*udc90 = ep->udc90;
	struct buffer		*buf;
	struct usb_request	*req;
	uint16_t		buf_offset = 0;
	uint16_t		fifo_len = ep->maxpacket;
	uint16_t		fifo_offset;

	if (slist_is_empty(&ep->req_queue))
		goto no_transfer;

	avr_write_reg8(UENUM, ep->id);

	cpu_irq_disable();

	dbg_verbose("ep%u-in: submit req_queue %p status=%02x\n",
			ep->id, slist_peek_head_node(&ep->req_queue),
			avr_read_reg8(UEINTX));

	assert(!test_bit(AT90USB_EP_ACTIVE_XFER, &ep->flags));

	set_bit(AT90USB_EP_ACTIVE_XFER, &ep->flags);

	cpu_irq_enable();

	if (!test_bit(AT90USB_EP_ENABLED, &ep->flags))
		goto no_transfer;

	cpu_irq_disable();
	req = slist_pop_head(&ep->req_queue, struct usb_request, node);
	cpu_irq_enable();
	if (slist_is_empty(&req->buf_list)) {
		assert(slist_is_empty(&ep->req_queue));
		goto no_transfer;
	}

	buf = slist_peek_head(&req->buf_list, struct buffer, node);
	fifo_offset = (avr_read_reg8(UEBCHX) << 8) | avr_read_reg8(UEBCLX);

	while (slist_node_is_valid(&req->buf_list, &buf->node)) {
		unsigned int nbytes;

		nbytes = min_u(fifo_len - fifo_offset, buf->len - buf_offset);

		/* Wait for a bank to be ready before writing the FIFO. */
		while (!(avr_read_reg8(UEINTX) & AT90USB_UEINTX_TXINI))
			barrier();

		cpu_irq_disable();
		/* Clear TXINI control bit to ack the ready bank. */
		avr_write_reg8(UEINTX, avr_read_reg8(UEINTX)
				& ~AT90USB_UEINTX_TXINI);
		cpu_irq_enable();

		copy_to_fifo((uint8_t *)((uintptr_t)buf->addr.phys
					+ buf_offset), nbytes);

		buf_offset += nbytes;
		fifo_offset += nbytes;

		if (fifo_offset == fifo_len || buf_offset == buf->len) {
			/* Clear FIFO control bit to send the contents. */
			cpu_irq_disable();
			avr_write_reg8(UEINTX, avr_read_reg8(UEINTX)
					& ~AT90USB_UEINTX_FIFOCON);
			cpu_irq_enable();
			fifo_offset = 0;
		}

		if (buf_offset == buf->len) {
			req->bytes_xfered += buf_offset;

			/* If this is the last buffer in the request we break
			 * before advancing to any potential next requests.
			 */
			if (req->buf_list.last == &buf->node)
				break;

			buf = slist_peek_next(&buf->node, struct buffer, node);
			buf_offset = 0;
		}

		if (!test_bit(AT90USB_EP_ENABLED, &ep->flags))
			goto no_transfer;
	}

	/* The compiler must not move any stores beyond this point. */
	barrier();

	at90usb_udc_req_done(&udc90->udc, req, 0);
	workqueue_add_task(&main_workqueue, &ep->task);
no_transfer:
	clear_bit(AT90USB_EP_ACTIVE_XFER, &ep->flags);
}

void udc_ep_submit_out_req(struct udc *udc, usb_ep_id_t ep_id,
		struct usb_request *req)
{
	struct at90usb_udc	*udc90 = at90usb_udc_of(udc);
	struct at90usb_udc_ep	*ep = &udc90->ep[ep_id];
	bool			queued = true;

	assert(cpu_irq_is_enabled());
	assert(ep_id > 0 && ep_id < APP_UDC_NR_ENDPOINTS);

	req->bytes_xfered = 0;
	req->status = OPERATION_IN_PROGRESS;

	cpu_irq_disable();
	if (test_bit(AT90USB_EP_ENABLED, &ep->flags)) {
		slist_insert_tail(&ep->req_queue, &req->node);
		if (!test_bit(AT90USB_EP_ACTIVE_XFER, &ep->flags)) {
			avr_write_reg8(UENUM, ep->id);
			ep->ueienx |= AT90USB_UEIENX_RXOUTE;
			avr_write_reg8(UEIENX, ep->ueienx);
		}
	} else {
		queued = false;
	}
	cpu_irq_enable();

	if (!queued)
		at90usb_udc_req_done(udc, req, ERR_FLUSHED);
}

void udc_ep_submit_in_req(struct udc *udc, usb_ep_id_t ep_id,
		struct usb_request *req)
{
	struct at90usb_udc	*udc90 = at90usb_udc_of(udc);
	struct at90usb_udc_ep	*ep = &udc90->ep[ep_id];
	bool			queued = true;

	assert(cpu_irq_is_enabled());
	assert(ep_id > 0 && ep_id < APP_UDC_NR_ENDPOINTS);

	req->bytes_xfered = 0;
	req->status = OPERATION_IN_PROGRESS;

	cpu_irq_disable();
	if (test_bit(AT90USB_EP_ENABLED, &ep->flags)) {
		slist_insert_tail(&ep->req_queue, &req->node);
		if (!test_bit(AT90USB_EP_ACTIVE_XFER, &ep->flags))
			workqueue_add_task(&main_workqueue, &ep->task);
	} else {
		queued = false;
	}
	cpu_irq_enable();

	if (!queued)
		at90usb_udc_req_done(udc, req, ERR_FLUSHED);
}

status_t udc_ep_is_halted(struct udc *udc, usb_ep_id_t ep)
{
	irqflags_t iflags;
	status_t retval;

	if (ep >= APP_UDC_NR_ENDPOINTS)
		return -1;

	iflags = cpu_irq_save();

	avr_write_reg8(UENUM, ep);
	retval = !!(avr_read_reg8(UECONX) & AT90USB_UECONX_STALLRQ);

	cpu_irq_restore(iflags);

	return retval;
}

status_t udc_ep_set_halt(struct udc *udc, usb_ep_id_t ep)
{
	irqflags_t	iflags;
	uint8_t		uecfg;

	dbg_verbose("at90usb-udc: ep%d: set halt\n", ep);

	if (ep >= APP_UDC_NR_ENDPOINTS)
		return -1;

	avr_write_reg8(UENUM, ep);

	/*
	 * Even though the function driver takes care not to request stall
	 * until it has received a callback for the data transfer, there's
	 * still a chance that the data transfer may get STALLed.
	 *
	 * This is because the callback happens when the transfer is complete,
	 * not when the transfers is actually done. At this point, there may
	 * still be IN data stuck in a bank waiting for the host to request it,
	 * and if so, the host will see a STALL instead of the data it asked
	 * for.
	 *
	 * Work around this by waiting for all IN banks to become empty before
	 * requesting a STALL. Ideally, an interrupt should be used, but that
	 * may cause us to send additional data before setting the STALL
	 * request, which would be just as bad.
	 *
	 * One way to improve this would be to set a flag indicating that the
	 * endpoint is really stalled and refusing to submit any more requests
	 * until the endpoint has been un-stalled. When NBUSYBK becomes 0, we
	 * can set STALLRQ and restart the queue when the stall is cleared by
	 * the host or some driver.
	 */
	uecfg = avr_read_reg8(UECFG0X);
	if (uecfg & AT90USB_UECFG0X_EPDIR_IN) {
		uint8_t uesta;

		/* Request stall as soon as the FIFO is empty */
		do {
			uesta = avr_read_reg8(UESTA0X);
		} while (AT90USB_UESTA0X_GET_NBUSYBK(uesta) != 0);
	}


	iflags = cpu_irq_save();
	avr_write_reg8(UECONX, avr_read_reg8(UECONX)
			| AT90USB_UECONX_STALLRQ);
	cpu_irq_restore(iflags);

	if (ep != 0 && !(uecfg & AT90USB_UECFG0X_EPDIR_IN)) {
		/*
		 * Flush the FIFO for OUT endpoints. The caller may be
		 * stalling because it doesn't want any more data, but
		 * the controller may have already received some.
		 */
		at90usb_udc_kill_all_banks(udc, ep);
	}

