krist10an/xplain-software-framework/source/drivers/usb/at90usb/at90usb_udc.c
	return 0;
}

status_t udc_ep_clear_halt(struct udc *udc, usb_ep_id_t ep)
{
	struct at90usb_udc *udc90 = at90usb_udc_of(udc);
	irqflags_t iflags;

	dbg_verbose("at90usb-udc: ep%d: clear halt (%swedged)\n", ep,
			test_bit(AT90USB_EP_WEDGE, &udc90->ep[ep].flags)
			? "" : "not ");

	if (ep >= APP_UDC_NR_ENDPOINTS)
		return -1;

	iflags = cpu_irq_save();

	avr_write_reg8(UENUM, ep);

	/* Always reset data toggle sequence */
	avr_write_reg8(UECONX, avr_read_reg8(UECONX) | AT90USB_UECONX_RSTDT);

	if (!test_bit(AT90USB_EP_WEDGE, &udc90->ep[ep].flags)) {
		/* Clear the STALL request */
		avr_write_reg8(UECONX, avr_read_reg8(UECONX)
				| AT90USB_UECONX_STALLRQC);
	}

	cpu_irq_restore(iflags);

	return 0;
}

bool udc_ep_is_wedged(struct udc *udc, usb_ep_id_t ep)
{
	struct at90usb_udc *udc90 = at90usb_udc_of(udc);

	assert(ep < APP_UDC_NR_ENDPOINTS);

	return test_bit(AT90USB_EP_WEDGE, &udc90->ep[ep].flags);
}

void udc_ep_set_wedge(struct udc *udc, usb_ep_id_t ep)
{
	struct at90usb_udc	*udc90 = at90usb_udc_of(udc);
	irqflags_t		iflags;

	dbg_verbose("at90usb-udc: ep%d: set wedge\n", ep);

	iflags = cpu_irq_save();
	set_bit(AT90USB_EP_WEDGE, &udc90->ep[ep].flags);

	/*
	 * This function isn't called in response to host control
	 * requests, so it's always a bug when ep isn't valid.
	 */
	assert(ep < APP_UDC_NR_ENDPOINTS);
	udc_ep_set_halt(udc, ep);

	cpu_irq_restore(iflags);
}

void udc_ep_clear_wedge(struct udc *udc, usb_ep_id_t ep)
{
	struct at90usb_udc	*udc90 = at90usb_udc_of(udc);
	irqflags_t		iflags;

	dbg_verbose("at90usb-udc: ep%d: clear wedge\n", ep);

	assert(ep < APP_UDC_NR_ENDPOINTS);

	iflags = cpu_irq_save();

	assert(!test_bit(AT90USB_EP_WEDGE, &udc90->ep[ep].flags)
			|| udc_ep_is_halted(udc, ep) > 0);

	clear_bit(AT90USB_EP_WEDGE, &udc90->ep[ep].flags);
	cpu_irq_restore(iflags);
}

/**
 * \internal
 * Configure an endpoint at the hardware level.
 *
 * \param id Endpoint number.
 * \param size Maximum packet size.
 * \param type Endpoint transfer type.
 * \param is_in true if the endpoint is an IN endpoint. Must be false
 *              for control endpoints.
 * \param nr_banks Number of FIFO banks (1 or 2).
 *
 * \retval STATUS_OK The endpoint was configured successfully
 * \retval ERR_INVALID_ARG The endpoint configuration is invalid
 */
static status_t at90usb_udc_configure_ep(uint8_t id, unsigned int size,
		enum usb_ep_xfer_type type, bool is_in, uint8_t nr_banks)
{
	irqflags_t	iflags;
	uint8_t		config;

	/** \todo Only endpoint 1 can be 256 bytes, max 64 for the rest. */
	assert(nr_banks >= 1 && nr_banks <= 2 && size >= 8 && size <= 256);

	iflags = cpu_irq_save();

	avr_write_reg8(UENUM, id);
	avr_write_reg8(UECONX, AT90USB_UECONX_EPEN);

	config = AT90USB_UECFG0X_EPTYPE(type);
	if (is_in)
		config |= AT90USB_UECFG0X_EPDIR_IN;

	avr_write_reg8(UECFG0X, config);

	config = (AT90USB_UECFG1X_ALLOC
			| AT90USB_UECFG1X_EPBK(nr_banks - 1));

	switch(size) {
	case 8:
		config |= AT90USB_UECFG1X_EPSIZE_8;
		break;
	case 16:
		config |= AT90USB_UECFG1X_EPSIZE_16;
		break;
	case 32:
		config |= AT90USB_UECFG1X_EPSIZE_32;
		break;
	case 64:
		config |= AT90USB_UECFG1X_EPSIZE_64;
		break;
	case 128:
		config |= AT90USB_UECFG1X_EPSIZE_128;
		break;
	case 256:
		config |= AT90USB_UECFG1X_EPSIZE_256;
		break;
	}

	avr_write_reg8(UECFG1X, config);
	if (!(avr_read_reg8(UESTA0X) & AT90USB_UESTA0X_CFGOK)) {
		avr_write_reg8(UECONX, 0);
		dbg_error("ep%u: configuration %02x invalid\n", id, config);
		cpu_irq_restore(iflags);
		return ERR_INVALID_ARG;
	}

	avr_write_reg8(UERST, AT90USB_UERST_EPRST(id));
	avr_write_reg8(UERST, 0);

	cpu_irq_restore(iflags);

	return STATUS_OK;
}

/**
 * \internal
 * \brief Flush a non-control endpoint.
 *
 * \param udc90 The AT90USB UDC instance.
 * \param ep An UDC endpoint instance.
 */
static void
at90usb_udc_ep_flush(struct at90usb_udc *udc90, struct at90usb_udc_ep *ep)
{
	struct udc		*udc = &udc90->udc;
	struct buffer		*buf;
	struct buffer		*next_buf;
	struct usb_request	*req;
	irqflags_t		iflags;

	assert(ep->id != 0 && ep->id < APP_UDC_NR_ENDPOINTS);
	assert(test_bit(AT90USB_EP_ENABLED, &ep->flags));

	/*
	 * First, reset the hardware state, but don't disable the
	 * endpoint or reset any data toggles.
	 */
	iflags = cpu_irq_save();

	/* Prevent queueing new requests */
	clear_bit(AT90USB_EP_ENABLED, &ep->flags);
	clear_bit(AT90USB_EP_ACTIVE_XFER, &ep->flags);

	ep->ueienx = 0;
	avr_write_reg8(UENUM, ep->id);
	avr_write_reg8(UEIENX, ep->ueienx);

	/* Flush all data from the FIFO */
	at90usb_udc_kill_all_banks(udc, ep->id);
	cpu_irq_restore(iflags);

	/* Then, terminate all queued requests */
	if (!slist_is_empty(&ep->req_queue)) {
		req = slist_pop_head(&ep->req_queue, struct usb_request, node);
		buf = slist_peek_head(&req->buf_list, struct buffer, node);
		while (slist_node_is_valid(&req->buf_list, &buf->node)) {
			next_buf = slist_peek_next(&buf->node,
					struct buffer, node);
			dbg_verbose("buf %p req [%p %p]\n",
					&buf->node, req->buf_list.first.next,
					req->buf_list.last);
			if (req->buf_list.last == &buf->node) {
				at90usb_udc_req_done(udc, req, ERR_FLUSHED);
				if (!slist_is_empty(&ep->req_queue))
					req = slist_pop_head(&ep->req_queue,
							struct usb_request,
							node);
			}

			buf = next_buf;
		}

		assert(slist_is_empty(&ep->req_queue));
	}
}

void udc_ep_flush(struct udc *udc, usb_ep_id_t ep_id)
{
	struct at90usb_udc	*udc90 = at90usb_udc_of(udc);
	struct at90usb_udc_ep	*ep;
	irqflags_t		iflags;

	dbg_verbose("at90usb-udc: flush ep%u\n", ep_id);

	ep = &udc90->ep[ep_id];
	at90usb_udc_ep_flush(udc90, ep);

	/* Allow queueing new requests */
	iflags = cpu_irq_save();
	set_bit(AT90USB_EP_ENABLED, &ep->flags);
	cpu_irq_restore(iflags);
}

/**
 * \internal
 * \brief Allocate a non-control endpoint.
 *
 * Allocate and initialize the basics variables for a non-control endpoint
 * instance. Also initialize the work queue handler.
 *
 * \param udc The UDC instance.
 * \param addr Endpoint address.
 * \param max_packet_size Endpoint maximum packet size.
 *
 * \return Address of the allocated endpoint instance, NULL on error.
 */
static struct at90usb_udc_ep *
at90usb_ep_alloc(struct udc *udc, uint8_t addr, uint16_t max_packet_size)
{
	struct at90usb_udc	*udc90 = at90usb_udc_of(udc);
	struct at90usb_udc_ep	*ep;
	uint8_t			index;

	index = addr & USB_EP_ADDR_MASK;
	assert(index > 0 && index < APP_UDC_NR_ENDPOINTS);

	ep = &udc90->ep[index];
	if (atomic_test_and_set_bit(AT90USB_EP_ALLOCATED, &ep->flags))
		return NULL;

