krist10an/xplain-software-framework/source/drivers/usb/at90usb/at90usb_udc.c
	/*
	 * No need for atomics since we have marked the endpoint as
	 * allocated but not enabled.
	 */
	if (addr & USB_DIR_IN)
		set_bit(AT90USB_EP_IS_IN, &ep->flags);

	ep->id = index;
	ep->udc90 = udc90;
	ep->ueienx = 0;
	ep->maxpacket = max_packet_size;

	slist_init(&ep->req_queue);

	if (test_bit(AT90USB_EP_IS_IN, &ep->flags))
		workqueue_task_init(&ep->task, at90usb_udc_submit_in_queue);
	else
		workqueue_task_init(&ep->task, at90usb_udc_submit_out_queue);

	return ep;
}

/**
 * \internal
 * \brief Enable a non-control endpoint.
 *
 * Configures and enables a non-control endpoint for transfers.
 *
 * \param ep An AT90USB UDC endpoint instance.
 * \param addr Endpoint address.
 * \param max_packet_size Endpoint maximum packet size.
 * \param type Endpoint transfer type.
 * \param nr_banks Number of endpoint banks.
 *
 * \return An allocated endpoint instance, or NULL on error.
 */
static usb_ep_id_t at90usb_ep_enable(struct at90usb_udc_ep *ep, uint8_t addr,
		uint16_t max_packet_size, enum usb_ep_xfer_type type,
		unsigned int nr_banks)
{
	status_t        ret;
	uint8_t         index;

	index = addr & USB_EP_ADDR_MASK;
	ret = at90usb_udc_configure_ep(index, max_packet_size, type,
			addr & USB_DIR_IN, nr_banks);
	if (ret)
		return ret;

	/*
	 * Make sure everything else has been updated before marking the
	 * endpoint as enabled.
	 */
	barrier();
	set_bit(AT90USB_EP_ENABLED, &ep->flags);

	return index;
}

usb_ep_id_t udc_ep_create_bulk(struct udc *udc, uint8_t addr,
		uint16_t max_packet_size)
{
	struct at90usb_udc_ep	*ep;
	usb_ep_id_t		ret;

	dbg_verbose("at90usb-udc: create BULK ep addr: %02x size: %u\n",
			addr, max_packet_size);

	ep = at90usb_ep_alloc(udc, addr, max_packet_size);
	if (!ep)
		return ERR_BUSY;

	ret = at90usb_ep_enable(ep, addr, max_packet_size,
			USB_EP_XFER_BULK, 2);
	if (ret < 0)
		atomic_clear_bit(AT90USB_EP_ALLOCATED, &ep->flags);

	return ret;
}

usb_ep_id_t udc_ep_create_interrupt(struct udc *udc, uint8_t addr,
		uint16_t max_packet_size)
{
	struct at90usb_udc_ep	*ep;
	status_t		ret;

	dbg_verbose("at90usb-udc: create INTERRUPT ep addr: %02x size: %u\n",
			addr, max_packet_size);

	ep = at90usb_ep_alloc(udc, addr, max_packet_size);
	if (!ep)
		return ERR_BUSY;

	ret = at90usb_ep_enable(ep, addr, max_packet_size,
			USB_EP_XFER_INTERRUPT, 2);
	if (ret < 0)
		atomic_clear_bit(AT90USB_EP_ALLOCATED, &ep->flags);

	return ret;
}

void udc_ep_destroy(struct udc *udc, usb_ep_id_t ep_id)
{
	struct at90usb_udc	*udc90 = at90usb_udc_of(udc);
	struct at90usb_udc_ep	*ep;
	irqflags_t		iflags;

	dbg_verbose("at90usb-udc: destroy ep%u\n", ep_id);

	assert(ep_id != 0 && ep_id < APP_UDC_NR_ENDPOINTS);

	ep = &udc90->ep[ep_id];
	at90usb_udc_ep_flush(udc90, ep);

	iflags = cpu_irq_save();

	avr_write_reg8(UENUM, ep_id);

	/* Now that we've flushed the queue, disable the endpoint */
	avr_write_reg8(UERST, AT90USB_UERST_EPRST(ep_id));
	avr_write_reg8(UERST, 0);

	avr_write_reg8(UECONX, 0);
	avr_write_reg8(UESTA0X, 0);

	/* Allow re-use after all the cleanup has been done */
	ep->flags = 0;
	cpu_irq_restore(iflags);
}

status_t udc_enter_test_mode(struct udc *udc, unsigned int mode)
{
	return -1;
}

/**
 * \internal
 * \brief Helper function to complete control endpoint USB requests.
 *
 * This helper function will set the USB request status flag and call the
 * request done callback if needed for requests on the control endpoint.
 *
 * \param udc The UDC instance.
 * \param ep The control endpoint instance.
 */
static void at90usb_ep0_tx_complete(struct udc *udc, struct at90usb_udc_ep *ep)
{
	struct usb_request	*req;
	struct buffer		*buf;
	unsigned int		buf_offset;
	unsigned int		bytes_written;

	if (slist_is_empty(&ep->req_queue)) {
		assert(slist_is_empty(&ep->buf_queue));
		return;
	}

	assert(!slist_is_empty(&ep->buf_queue));

	req = slist_peek_head(&ep->req_queue, struct usb_request, node);
	buf = slist_peek_head(&ep->buf_queue, struct buffer, node);

	buf_offset = ep->buf_offset;
	bytes_written = ep->bytes_written;

	req->bytes_xfered += bytes_written;

	while (bytes_written && buf_offset + bytes_written >= buf->len) {
		bytes_written -= buf->len - buf_offset;
		buf_offset = 0;
		slist_pop_head_node(&ep->buf_queue);
		if (bytes_written)
			assert(!slist_is_empty(&ep->buf_queue));
		buf = slist_peek_head(&ep->buf_queue, struct buffer, node);
	}

	if (slist_is_empty(&ep->buf_queue)) {
		slist_init(&ep->req_queue);
		/* The queue is now empty */
		slist_give_back_head(&req->buf_list, &ep->buf_queue);
		clear_bit(AT90USB_EP_ACTIVE_XFER, &ep->flags);
		at90usb_udc_req_done(udc, req, 0);
	}

	ep->buf_offset = bytes_written;
	ep->bytes_written = 0;
}

/**
 * \internal
 * \brief Flush a control endpoint.
 *
 * \param udc The UDC instance.
 * \param ep The control endpoint instance.
 */
static void at90usb_ep0_tx_flush(struct udc *udc, struct at90usb_udc_ep *ep)
{
	/* First, complete all buffers that have been submitted */
	at90usb_ep0_tx_complete(udc, ep);

	/* Then, if the request is still not done, terminate it */
	if (!slist_is_empty(&ep->req_queue)) {
		struct usb_request	*req;

		req = slist_pop_head(&ep->req_queue, struct usb_request, node);
		assert(slist_is_empty(&ep->req_queue));
		slist_init(&ep->buf_queue);
		ep->buf_offset = 0;
		clear_bit(AT90USB_EP_ACTIVE_XFER, &ep->flags);
		at90usb_udc_req_done(udc, req, ERR_PROTOCOL);
	}
}

/**
 * \internal
 * \brief The AT90USB UDC endpoint 0 work task handler.
 *
 * \note This function will disable and enable interrupts while processing the
 * queue, but will return with interrupt flag as when called.
 *
 * \param task Work queue task.
 *
 * \pre Called from workqueue, interrupts enabled.
 */
static void at90usb_udc_ep0_worker(struct workqueue_task *task)
{
	struct at90usb_udc_ep	*ep = at90usb_ep_task_of(task);
	struct at90usb_udc	*udc90 = ep->udc90;
	uint8_t			status;
	uint8_t			enabled;
	uint8_t			pending;

	avr_write_reg8(UENUM, 0);

	status  = avr_read_reg8(UEINTX);
	enabled = ep->ueienx;
	pending = enabled & status;

	if (pending & AT90USB_UEINTX_RXOUTI) {
		struct usb_request	*req;
		struct buffer		*buf;
		uint16_t		fifo_len;
		uint16_t		buf_offset;
		uint16_t		fifo_offset = 0;

		cpu_irq_disable();
		if (slist_is_empty(&ep->req_queue)) {
			assert(slist_is_empty(&ep->buf_queue));
			/* Unexpected data -- stall the endpoint */
			cpu_irq_enable();
			goto stall;
		}

		req = slist_peek_head(&ep->req_queue, struct usb_request, node);
		cpu_irq_enable();

		buf_offset = ep->buf_offset;
		fifo_len = (avr_read_reg8(UEBCHX) << 8) | avr_read_reg8(UEBCLX);

		cpu_irq_disable();
		while (!slist_is_empty(&ep->buf_queue)) {
			unsigned int nbytes;

			cpu_irq_disable();
			buf = slist_peek_head(&ep->buf_queue,
					struct buffer, node);
			cpu_irq_enable();

			nbytes = min_u(fifo_len - fifo_offset,
					buf->len - buf_offset);

			copy_from_fifo((uint8_t *)((uintptr_t)buf->addr.phys
						+ buf_offset), nbytes);

			buf_offset += nbytes;
			fifo_offset += nbytes;

			if (buf_offset == buf->len) {
				req->bytes_xfered += buf_offset;
				cpu_irq_disable();
				slist_pop_head_node(&ep->buf_queue);
				cpu_irq_enable();
				buf_offset = 0;
			}
		}

		cpu_irq_disable();
		avr_write_reg8(UEINTX, avr_read_reg8(UEINTX)
				& ~AT90USB_UEINTX_RXOUTI);
		cpu_irq_enable();
		ep->buf_offset = buf_offset;

		cpu_irq_disable();
		if (slist_is_empty(&ep->buf_queue)) {
			/* Request is done */
			assert(buf_offset == 0);
			slist_init(&ep->req_queue);
			ep->ueienx &= ~AT90USB_UEIENX_RXOUTE;
			udc90->ctrl_state = EP0_STATE_SETUP;
			clear_bit(AT90USB_EP_ACTIVE_XFER, &ep->flags);
			cpu_irq_enable();
			at90usb_udc_req_done(&udc90->udc, req, 0);
		}
		cpu_irq_enable();
	}
	if (pending & AT90USB_UEINTX_TXINI) {
		struct usb_request	*req;
		struct buffer		*buf;
		unsigned int		buf_offset;
		unsigned int		fifo;
		unsigned int		fifo_end;

