krist10an/xplain-software-framework/source/drivers/usb/at90usb/at90usb_udc.c
		if (udc90->ctrl_state == EP0_STATE_STATUS_IN) {
			struct usb_setup_req *setup;

			/* Status IN complete */
			setup = &udc90->setup_req;
			if (setup->bRequest == USB_REQ_SET_ADDRESS) {
				uint8_t addr = le16_to_cpu(setup->wValue)
					& AT90USB_UDADDR_UADD_MASK;
				/* Address and enable address must be written
				 * in two stages according to datasheet. */
				avr_write_reg8(UDADDR, addr);
				avr_write_reg8(UDADDR,
						AT90USB_UDADDR_ADDEN | addr);
				udc90->udc.address = addr;
			}
			cpu_irq_disable();
			ep->ueienx &= ~AT90USB_UEIENX_TXINE;
			cpu_irq_enable();
			udc90->ctrl_state = EP0_STATE_SETUP;
			goto out;
		}

		/* Send ZLP to terminate the current transfer if required */
		if (udc90->ctrl_state == EP0_STATE_DATA_ZLP) {
			udc90->ctrl_state = EP0_STATE_DATA_IN;
			cpu_irq_disable();
			avr_write_reg8(UEINTX, avr_read_reg8(UEINTX)
					& ~AT90USB_UEINTX_TXINI);
			cpu_irq_enable();
			goto out;
		}

		/* Terminate any completed buffers */
		at90usb_ep0_tx_complete(&udc90->udc, ep);

		/* Submit any remaining buffers */
		if (slist_is_empty(&ep->buf_queue)) {
			cpu_irq_disable();
			ep->ueienx &= ~AT90USB_UEIENX_TXINE;
			cpu_irq_enable();
			udc90->ctrl_state = EP0_STATE_SETUP;
			goto out;
		}

		buf_offset = ep->buf_offset;
		cpu_irq_disable();
		buf = slist_peek_head(&ep->buf_queue, struct buffer, node);
		cpu_irq_enable();

		fifo = 0;
		fifo_end = APP_UDC_MAXPACKETSIZE0;
		while (fifo < APP_UDC_MAXPACKETSIZE0) {
			unsigned int	nbytes;
			unsigned int	buf_len;

			buf_len = buf->len;

			nbytes = min_u(fifo_end - fifo, buf_len - buf_offset);
			dbg_verbose("fifo %u data %p off %u nbytes %u\n",
					fifo, buf->addr.ptr,
					buf_offset, nbytes);

			copy_to_fifo((uint8_t *)((uintptr_t)buf->addr.phys
						+ buf_offset), nbytes);

			buf_offset += nbytes;
			fifo += nbytes;

			if (buf_offset == buf_len) {
				cpu_irq_disable();
				if (slist_node_is_last(&ep->buf_queue,
							&buf->node))
					break;
				buf = slist_peek_next(&buf->node,
						struct buffer, node);
				cpu_irq_enable();
				buf_offset = 0;
			}
		}

		cpu_irq_disable();
		avr_write_reg8(UEINTX, avr_read_reg8(UEINTX)
					& ~AT90USB_UEINTX_TXINI);
		cpu_irq_enable();

		ep->bytes_written = (unsigned long)fifo;

		cpu_irq_disable();
		req = slist_peek_head(&ep->req_queue, struct usb_request, node);
		if (&buf->node == req->buf_list.last
				&& buf_offset == buf->len
				&& test_bit(USB_REQ_SHORT_PKT, &req->flags)
				&& fifo == fifo_end)
			udc90->ctrl_state = EP0_STATE_DATA_ZLP;
		cpu_irq_enable();
	}
	if (pending & AT90USB_UEINTX_RXSTPI) {
		struct usb_setup_req	*setup;
		uint16_t		byte_count;

		setup = &udc90->setup_req;

		/*
		 * A SETUP packet clears the TX complete interrupt, so
		 * complete all submitted requests now.
		 */
		if (enabled & AT90USB_UEINTX_TXINI) {
			cpu_irq_disable();
			avr_write_reg8(UEINTX, avr_read_reg8(UEINTX)
					& ~AT90USB_UEINTX_TXINI);
			cpu_irq_enable();
			at90usb_ep0_tx_flush(&udc90->udc, ep);
		}

		byte_count = (avr_read_reg8(UEBCHX) << 8) |
			avr_read_reg8(UEBCLX);

		if (byte_count != sizeof(*setup)) {
			/* Invalid SETUP packet length -- stall */
			cpu_irq_disable();
			avr_write_reg8(UEINTX, avr_read_reg8(UEINTX)
					& ~AT90USB_UEINTX_RXSTPI);
			cpu_irq_enable();
			goto stall;
		}

		copy_from_fifo((uint8_t *)setup, sizeof(*setup));

		cpu_irq_disable();
		avr_write_reg8(UEINTX, avr_read_reg8(UEINTX)
				& ~AT90USB_UEINTX_RXSTPI);
		cpu_irq_enable();

		if (udc_lib_process_setup_request(&udc90->udc, setup) < 0)
			goto stall;
	}

out:
	avr_write_reg8(UEIENX, ep->ueienx);
	return;

stall:
	cpu_irq_disable();
	ep->ueienx &= ~(AT90USB_UEIENX_RXOUTE | AT90USB_UEIENX_TXINE);
	cpu_irq_enable();
	avr_write_reg8(UEIENX, ep->ueienx);
	udc_ep_set_halt(&udc90->udc, 0);
	goto out;
}

static struct at90usb_udc the_at90usb_udc;

/**
 * \internal
 * \brief The AT90USB device-mode device work task handler.
 *
 * \pre Called from workqueue, interrupts enabled.
 */
static void at90usb_udc_device_worker(struct workqueue_task *task)
{
	if (avr_read_reg8(UDINT) & AT90USB_UDINT_EORSTI) {
		struct at90usb_udc	*udc90 = at90usb_udc_task_of(task);
		struct at90usb_udc_ep	*ep = &udc90->ep[0];
		struct udc		*udc = &udc90->udc;
		irqflags_t		iflags;

		avr_write_reg8(UDINT, avr_read_reg8(UDINT)
				& ~AT90USB_UDINT_EORSTI);

		/* Reset the device state */
		udc->address = 0;
		clear_bit(UDC_IS_SUSPENDED, &udc->flags);

		/* Figure out what speed we're running at */
#ifdef CONFIG_UDC_FULL_SPEED
		udc->speed = USB_SPEED_FULL;
#else
		udc->speed = USB_SPEED_LOW;
#endif
		dbg_verbose("at90usb-udc: reset speed %u\n", udc->speed);

		at90usb_ep0_tx_flush(udc, &udc90->ep[0]);
		usb_dev_reset(udc);

		/* Set up ep0 for control transfers */
		if (at90usb_udc_configure_ep(0, APP_UDC_MAXPACKETSIZE0,
					USB_EP_XFER_CONTROL, false, 1)) {
			udc->speed = USB_SPEED_UNKNOWN;
			goto out;
		}

		/* Get ready to be enumerated */
		udc90->ctrl_state = EP0_STATE_SETUP;

		iflags = cpu_irq_save();

		avr_write_reg8(UENUM, 0);
		ep->ueienx |= AT90USB_UEIENX_RXSTPE;
		avr_write_reg8(UEIENX, ep->ueienx);

		cpu_irq_restore(iflags);
	}
out:
	avr_write_reg8(UDIEN, AT90USB_UDIEN_EORSTE);
}

/**
 * \internal
 * \brief Helper function to let the UDC maybe attach to the USB bus.
 *
 * \param udc90 The AT90USB UDC instance.
 */
static void at90usb_udc_maybe_attach(struct at90usb_udc *udc90)
{
	struct udc	*udc = &udc90->udc;

	dbg_verbose("at90usb_udc maybe attach: flags=0x%x\n", udc->flags);
	if (at90usb_udc_is_enabled(udc90)
			&& test_bit(UDC_HAS_POWER, &udc->flags)
			&& test_bit(UDC_AUTOATTACH, &udc->flags)) {
		dbg_verbose("at90usb_udc: attaching...\n");
#ifdef CONFIG_AT90USB_ENABLE_UVREG
		avr_write_reg8(UHWCON, avr_read_reg8(UHWCON)
				| AT90USB_UHWCON_UVREGE);
#endif
		avr_write_reg8(UDCON, avr_read_reg8(UDCON)
				& ~AT90USB_UDCON_DETACH);
		avr_write_reg8(UDIEN, AT90USB_UDIEN_EORSTE);
	}
}

/**
 * \internal
 * \brief Helper function to let the UDC detach from the USB bus.
 *
 * \param udc90 The AT90USB UDC instance.
 */
static void at90usb_udc_detach(struct at90usb_udc *udc90)
{
	struct udc	*udc = &udc90->udc;
	uint8_t		udcon;

