krist10an/xplain-software-framework/source/drivers/usb/at90usb/at90usb_udc.c
	dbg_verbose("at90usb_udc detach: flags=0x%x\n", udc->flags);

	udc->speed = USB_SPEED_UNKNOWN;
	udc->address = 0;
	udc->flags &= (1 << UDC_IS_ENABLED) | (1 << UDC_HAS_POWER)
			| (1 << UDC_AUTOATTACH);

	udcon = avr_read_reg8(UDCON);

	if (!(udcon & AT90USB_UDCON_DETACH)) {
		usb_dev_reset(&udc90->udc);

		avr_write_reg8(UDCON, udcon | AT90USB_UDCON_DETACH);
		avr_write_reg8(UDIEN, 0);
	}
}

/**
 * \internal
 * \brief Signal that a high Vbus level has been detected.
 *
 * This function is called by the AT90USB bus interface driver when Vbus
 * power is provided by the host.
 *
 * \param udc90 The AT90USB UDC instance.
 */
void at90usb_udc_vbus_on(struct at90usb_udc *udc90)
{
	struct udc *udc = &udc90->udc;

	if (!test_bit(UDC_HAS_POWER, &udc->flags)) {
		dbg_verbose("at90usb_udc: Vbus ON\n");
		set_bit(UDC_HAS_POWER, &udc->flags);
		at90usb_udc_maybe_attach(udc90);
	}
}

/**
 * \internal
 * \brief Signal that a low Vbus level has been detected.
 *
 * This function is called by the AT90USB bus interface driver when Vbus
 * power is no longer provided by the host.
 *
 * \param udc90 The AT90USB UDC instance.
 */
void at90usb_udc_vbus_off(struct at90usb_udc *udc90)
{
	struct udc *udc = &udc90->udc;

	if (test_bit(UDC_HAS_POWER, &udc->flags)) {
		dbg_verbose("at90usb_udc: Vbus OFF\n");
		clear_bit(UDC_HAS_POWER, &udc->flags);
		at90usb_udc_detach(udc90);
	}
}

void udc_attach(struct udc *udc)
{
	struct at90usb_udc *udc90 = at90usb_udc_of(udc);
	irqflags_t	iflags;

	iflags = cpu_irq_save();
	if (!test_bit(UDC_AUTOATTACH, &udc->flags)) {
		set_bit(UDC_AUTOATTACH, &udc->flags);
		at90usb_udc_maybe_attach(udc90);
	}
	cpu_irq_restore(iflags);
}

void udc_detach(struct udc *udc)
{
	struct at90usb_udc *udc90 = at90usb_udc_of(udc);
	irqflags_t	iflags;

	iflags = cpu_irq_save();
	if (test_bit(UDC_AUTOATTACH, &udc->flags)) {
		clear_bit(UDC_AUTOATTACH, &udc->flags);
		at90usb_udc_detach(udc90);
	}
	cpu_irq_restore(iflags);
}

/**
 * \internal
 * \brief Initialize the device part of the AT90USB controller.
 *
 * This function does any device-side initialization necessary when
 * the AT90USB controller as a whole is being initialized. It does not
 * enable any device-side functionality.
 *
 * \return The AT90USB device controller (UDC) instance.
 */
struct at90usb_udc *at90usb_udc_init(void)
{
	struct at90usb_udc *udc90 = &the_at90usb_udc;

	slist_init(&udc90->ep[0].req_queue);
	slist_init(&udc90->ep[0].buf_queue);

	udc90->udc.flags = 0;

	workqueue_task_init(&udc90->task, at90usb_udc_device_worker);

	udc90->ep[0].id = 0;
	udc90->ep[0].udc90 = udc90;

	workqueue_task_init(&udc90->ep[0].task, at90usb_udc_ep0_worker);

#ifdef CONFIG_UDC_LOW_SPEED
	avr_write_reg8(UDCON, avr_read_reg8(UDCON) | AT90USB_UDCON_LSM);
#else
	avr_write_reg8(UDCON, avr_read_reg8(UDCON) & ~AT90USB_UDCON_LSM);
#endif

	return udc90;
}

/**
 * \internal
 * \brief Shut down the device part of the AT90USB controller.
 *
 * This function does any device-side cleanups necessary when the AT90USB
 * controller as a whole is being shut down.
 *
 * \param udc90 The AT90USB UDC instance.
 */
void at90usb_udc_shutdown(struct at90usb_udc *udc90)
{
	udc90->udc.flags = 0;
}

//! @}
